//using System;

//namespace Tetris
//{
//	//--------------------------------------------------------------------------------
//	// 名前: Entry
//	// 概要: アプリケーションのエントリーポイントを提供するクラス
//	//       アプリケーション本体となるクラス
//	//--------------------------------------------------------------------------------
//	class EntryPoint
//	{
//		// インスタンス化不能
//		private EntryPoint(){}

//		private static readonly Tetris tetris;

//		//--------------------------------------------------------------------------------
//		// 名前: EntryPoint()
//		// 概要: コンストラクタ
//		//--------------------------------------------------------------------------------
//		static EntryPoint()
//		{
//			tetris = new Tetris();
//		}

//		//--------------------------------------------------------------------------------
//		// 名前: Main()
//		// 概要: ｱﾌﾟﾘｹｰｼｮﾝのメインｴﾝﾄﾘﾎﾟｲﾝﾄ
//		//--------------------------------------------------------------------------------
//		[STAThread]
//		public static void Main() 
//		{
//			tetris.MainLoop();
//		}
//	}
//}



